apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_gpio_m33_u3u5.h
#if STM32_NPORTS > 4
#  define STM32_GPIOE_MODER        (STM32_GPIOE_BASE + STM32_GPIO_MODER_OFFSET)
#  define STM32_GPIOE_OTYPER       (STM32_GPIOE_BASE + STM32_GPIO_OTYPER_OFFSET)
#  define STM32_GPIOE_OSPEED       (STM32_GPIOE_BASE + STM32_GPIO_OSPEED_OFFSET)
#  define STM32_GPIOE_PUPDR        (STM32_GPIOE_BASE + STM32_GPIO_PUPDR_OFFSET)
#  define STM32_GPIOE_IDR          (STM32_GPIOE_BASE + STM32_GPIO_IDR_OFFSET)
#  define STM32_GPIOE_ODR          (STM32_GPIOE_BASE + STM32_GPIO_ODR_OFFSET)
#  define STM32_GPIOE_BSRR         (STM32_GPIOE_BASE + STM32_GPIO_BSRR_OFFSET)
#  define STM32_GPIOE_LCKR         (STM32_GPIOE_BASE + STM32_GPIO_LCKR_OFFSET)
#  define STM32_GPIOE_AFRL         (STM32_GPIOE_BASE + STM32_GPIO_AFRL_OFFSET)
#  define STM32_GPIOE_AFRH         (STM32_GPIOE_BASE + STM32_GPIO_AFRH_OFFSET)
#  define STM32_GPIOE_BRR          (STM32_GPIOE_BASE + STM32_GPIO_BRR_OFFSET)
#  define STM32_GPIOE_HSLVR        (STM32_GPIOE_BASE + STM32_GPIO_HSLVR_OFFSET)
#  define STM32_GPIOE_SECCFGR      (STM32_GPIOE_BASE + STM32_GPIO_SECCFGR_OFFSET)
#endif

#if STM32_NPORTS > 5
#  define STM32_GPIOF_MODER        (STM32_GPIOF_BASE + STM32_GPIO_MODER_OFFSET)
#  define STM32_GPIOF_OTYPER       (STM32_GPIOF_BASE + STM32_GPIO_OTYPER_OFFSET)
#  define STM32_GPIOF_OSPEED       (STM32_GPIOF_BASE + STM32_GPIO_OSPEED_OFFSET)
#  define STM32_GPIOF_PUPDR        (STM32_GPIOF_BASE + STM32_GPIO_PUPDR_OFFSET)
#  define STM32_GPIOF_IDR          (STM32_GPIOF_BASE + STM32_GPIO_IDR_OFFSET)
#  define STM32_GPIOF_ODR          (STM32_GPIOF_BASE + STM32_GPIO_ODR_OFFSET)
#  define STM32_GPIOF_BSRR         (STM32_GPIOF_BASE + STM32_GPIO_BSRR_OFFSET)
#  define STM32_GPIOF_LCKR         (STM32_GPIOF_BASE + STM32_GPIO_LCKR_OFFSET)
#  define STM32_GPIOF_AFRL         (STM32_GPIOF_BASE + STM32_GPIO_AFRL_OFFSET)
#  define STM32_GPIOF_AFRH         (STM32_GPIOF_BASE + STM32_GPIO_AFRH_OFFSET)
#  define STM32_GPIOF_BRR          (STM32_GPIOF_BASE + STM32_GPIO_BRR_OFFSET)
#  define STM32_GPIOF_HSLVR        (STM32_GPIOF_BASE + STM32_GPIO_HSLVR_OFFSET)
#  define STM32_GPIOF_SECCFGR      (STM32_GPIOF_BASE + STM32_GPIO_SECCFGR_OFFSET)
#endif

#if STM32_NPORTS > 6
#  define STM32_GPIOG_MODER        (STM32_GPIOG_BASE + STM32_GPIO_MODER_OFFSET)
#  define STM32_GPIOG_OTYPER       (STM32_GPIOG_BASE + STM32_GPIO_OTYPER_OFFSET)
#  define STM32_GPIOG_OSPEED       (STM32_GPIOG_BASE + STM32_GPIO_OSPEED_OFFSET)
#  define STM32_GPIOG_PUPDR        (STM32_GPIOG_BASE + STM32_GPIO_PUPDR_OFFSET)
#  define STM32_GPIOG_IDR          (STM32_GPIOG_BASE + STM32_GPIO_IDR_OFFSET)
#  define STM32_GPIOG_ODR          (STM32_GPIOG_BASE + STM32_GPIO_ODR_OFFSET)
#  define STM32_GPIOG_BSRR         (STM32_GPIOG_BASE + STM32_GPIO_BSRR_OFFSET)
#  define STM32_GPIOG_LCKR         (STM32_GPIOG_BASE + STM32_GPIO_LCKR_OFFSET)
#  define STM32_GPIOG_AFRL         (STM32_GPIOG_BASE + STM32_GPIO_AFRL_OFFSET)
#  define STM32_GPIOG_AFRH         (STM32_GPIOG_BASE + STM32_GPIO_AFRH_OFFSET)
#  define STM32_GPIOG_BRR          (STM32_GPIOG_BASE + STM32_GPIO_BRR_OFFSET)
#  define STM32_GPIOG_HSLVR        (STM32_GPIOG_BASE + STM32_GPIO_HSLVR_OFFSET)
#  define STM32_GPIOG_SECCFGR      (STM32_GPIOG_BASE + STM32_GPIO_SECCFGR_OFFSET)
#endif

#if STM32_NPORTS > 7
#  define STM32_GPIOH_MODER        (STM32_GPIOH_BASE + STM32_GPIO_MODER_OFFSET)
#  define STM32_GPIOH_OTYPER       (STM32_GPIOH_BASE + STM32_GPIO_OTYPER_OFFSET)
#  define STM32_GPIOH_OSPEED       (STM32_GPIOH_BASE + STM32_GPIO_OSPEED_OFFSET)
#  define STM32_GPIOH_PUPDR        (STM32_GPIOH_BASE + STM32_GPIO_PUPDR_OFFSET)
#  define STM32_GPIOH_IDR          (STM32_GPIOH_BASE + STM32_GPIO_IDR_OFFSET)
#  define STM32_GPIOH_ODR          (STM32_GPIOH_BASE + STM32_GPIO_ODR_OFFSET)
#  define STM32_GPIOH_BSRR         (STM32_GPIOH_BASE + STM32_GPIO_BSRR_OFFSET)
#  define STM32_GPIOH_LCKR         (STM32_GPIOH_BASE + STM32_GPIO_LCKR_OFFSET)
#  define STM32_GPIOH_AFRL         (STM32_GPIOH_BASE + STM32_GPIO_AFRL_OFFSET)
#  define STM32_GPIOH_AFRH         (STM32_GPIOH_BASE + STM32_GPIO_AFRH_OFFSET)
#  define STM32_GPIOH_BRR          (STM32_GPIOH_BASE + STM32_GPIO_BRR_OFFSET)
#  define STM32_GPIOH_HSLVR        (STM32_GPIOH_BASE + STM32_GPIO_HSLVR_OFFSET)
#  define STM32_GPIOH_SECCFGR      (STM32_GPIOH_BASE + STM32_GPIO_SECCFGR_OFFSET)
#endif

#if STM32_NPORTS > 8
#  define STM32_GPIOI_MODER        (STM32_GPIOI_BASE + STM32_GPIO_MODER_OFFSET)
#  define STM32_GPIOI_OTYPER       (STM32_GPIOI_BASE + STM32_GPIO_OTYPER_OFFSET)
#  define STM32_GPIOI_OSPEED       (STM32_GPIOI_BASE + STM32_GPIO_OSPEED_OFFSET)
#  define STM32_GPIOI_PUPDR        (STM32_GPIOI_BASE + STM32_GPIO_PUPDR_OFFSET)
#  define STM32_GPIOI_IDR          (STM32_GPIOI_BASE + STM32_GPIO_IDR_OFFSET)
#  define STM32_GPIOI_ODR          (STM32_GPIOI_BASE + STM32_GPIO_ODR_OFFSET)
#  define STM32_GPIOI_BSRR         (STM32_GPIOI_BASE + STM32_GPIO_BSRR_OFFSET)
#  define STM32_GPIOI_LCKR         (STM32_GPIOI_BASE + STM32_GPIO_LCKR_OFFSET)
#  define STM32_GPIOI_AFRL         (STM32_GPIOI_BASE + STM32_GPIO_AFRL_OFFSET)
#  define STM32_GPIOI_AFRH         (STM32_GPIOI_BASE + STM32_GPIO_AFRH_OFFSET)
#  define STM32_GPIOI_BRR          (STM32_GPIOI_BASE + STM32_GPIO_BRR_OFFSET)
#  define STM32_GPIOI_HSLVR        (STM32_GPIOI_BASE + STM32_GPIO_HSLVR_OFFSET)
#  define STM32_GPIOI_SECCFGR      (STM32_GPIOI_BASE + STM32_GPIO_SECCFGR_OFFSET)
#endif

/* Register Bitfield Definitions ********************************************/

/* GPIO port mode register */

#define GPIO_MODER_MODE0_SHIFT      (0)
#define GPIO_MODER_MODE0_MASK       (0x3 << GPIO_MODER_MODE0_SHIFT)
#define GPIO_MODER_MODE0(n)         ((n) << GPIO_MODER_MODE0_SHIFT)
#define GPIO_MODER_MODE1_SHIFT      (2)
#define GPIO_MODER_MODE1_MASK       (0x3 << GPIO_MODER_MODE1_SHIFT)
#define GPIO_MODER_MODE1(n)         ((n) << GPIO_MODER_MODE1_SHIFT)
#define GPIO_MODER_MODE2_SHIFT      (4)
#define GPIO_MODER_MODE2_MASK       (0x3 << GPIO_MODER_MODE2_SHIFT)
#define GPIO_MODER_MODE2(n)         ((n) << GPIO_MODER_MODE2_SHIFT)
#define GPIO_MODER_MODE3_SHIFT      (6)
#define GPIO_MODER_MODE3_MASK       (0x3 << GPIO_MODER_MODE3_SHIFT)
#define GPIO_MODER_MODE3(n)         ((n) << GPIO_MODER_MODE3_SHIFT)
#define GPIO_MODER_MODE4_SHIFT      (8)
#define GPIO_MODER_MODE4_MASK       (0x3 << GPIO_MODER_MODE4_SHIFT)
#define GPIO_MODER_MODE4(n)         ((n) << GPIO_MODER_MODE4_SHIFT)
#define GPIO_MODER_MODE5_SHIFT      (10)
#define GPIO_MODER_MODE5_MASK       (0x3 << GPIO_MODER_MODE5_SHIFT)
#define GPIO_MODER_MODE5(n)         ((n) << GPIO_MODER_MODE5_SHIFT)
#define GPIO_MODER_MODE6_SHIFT      (12)
#define GPIO_MODER_MODE6_MASK       (0x3 << GPIO_MODER_MODE6_SHIFT)
#define GPIO_MODER_MODE6(n)         ((n) << GPIO_MODER_MODE6_SHIFT)
#define GPIO_MODER_MODE7_SHIFT      (14)
#define GPIO_MODER_MODE7_MASK       (0x3 << GPIO_MODER_MODE7_SHIFT)
#define GPIO_MODER_MODE7(n)         ((n) << GPIO_MODER_MODE7_SHIFT)
#define GPIO_MODER_MODE8_SHIFT      (16)
#define GPIO_MODER_MODE8_MASK       (0x3 << GPIO_MODER_MODE8_SHIFT)
#define GPIO_MODER_MODE8(n)         ((n) << GPIO_MODER_MODE8_SHIFT)
#define GPIO_MODER_MODE9_SHIFT      (18)
#define GPIO_MODER_MODE9_MASK       (0x3 << GPIO_MODER_MODE9_SHIFT)
#define GPIO_MODER_MODE9(n)         ((n) << GPIO_MODER_MODE9_SHIFT)
#define GPIO_MODER_MODE10_SHIFT     (20)
#define GPIO_MODER_MODE10_MASK      (0x3 << GPIO_MODER_MODE10_SHIFT)
#define GPIO_MODER_MODE10(n)        ((n) << GPIO_MODER_MODE10_SHIFT)
#define GPIO_MODER_MODE11_SHIFT     (22)
#define GPIO_MODER_MODE11_MASK      (0x3 << GPIO_MODER_MODE11_SHIFT)
#define GPIO_MODER_MODE11(n)        ((n) << GPIO_MODER_MODE11_SHIFT)
#define GPIO_MODER_MODE12_SHIFT     (24)
#define GPIO_MODER_MODE12_MASK      (0x3 << GPIO_MODER_MODE12_SHIFT)
#define GPIO_MODER_MODE12(n)        ((n) << GPIO_MODER_MODE12_SHIFT)
#define GPIO_MODER_MODE13_SHIFT     (26)
#define GPIO_MODER_MODE13_MASK      (0x3 << GPIO_MODER_MODE13_SHIFT)
#define GPIO_MODER_MODE13(n)        ((n) << GPIO_MODER_MODE13_SHIFT)
#define GPIO_MODER_MODE14_SHIFT     (28)
#define GPIO_MODER_MODE14_MASK      (0x3 << GPIO_MODER_MODE14_SHIFT)
#define GPIO_MODER_MODE14(n)        ((n) << GPIO_MODER_MODE14_SHIFT)
#define GPIO_MODER_MODE15_SHIFT     (30)
#define GPIO_MODER_MODE15_MASK      (0x3 << GPIO_MODER_MODE15_SHIFT)
#define GPIO_MODER_MODE15(n)        ((n) << GPIO_MODER_MODE15_SHIFT)

/* GPIO port output type register */

