apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_gpio_m33_u3u5.h
#define GPIO_OTYPER_OT0             (1 << 0)
#define GPIO_OTYPER_OT1             (1 << 1)
#define GPIO_OTYPER_OT2             (1 << 2)
#define GPIO_OTYPER_OT3             (1 << 3)
#define GPIO_OTYPER_OT4             (1 << 4)
#define GPIO_OTYPER_OT5             (1 << 5)
#define GPIO_OTYPER_OT6             (1 << 6)
#define GPIO_OTYPER_OT7             (1 << 7)
#define GPIO_OTYPER_OT8             (1 << 8)
#define GPIO_OTYPER_OT9             (1 << 9)
#define GPIO_OTYPER_OT10            (1 << 10)
#define GPIO_OTYPER_OT11            (1 << 11)
#define GPIO_OTYPER_OT12            (1 << 12)
#define GPIO_OTYPER_OT13            (1 << 13)
#define GPIO_OTYPER_OT14            (1 << 14)
#define GPIO_OTYPER_OT15            (1 << 15)

/* GPIO port output speed register */

#define GPIO_OSPEEDR_OSPEED0_SHIFT  (0)
#define GPIO_OSPEEDR_OSPEED0_MASK   (0x3 << GPIO_OSPEEDR_OSPEED0_SHIFT)
#define GPIO_OSPEEDR_OSPEED0(n)     ((n) << GPIO_OSPEEDR_OSPEED0_SHIFT)
#define GPIO_OSPEEDR_OSPEED1_SHIFT  (2)
#define GPIO_OSPEEDR_OSPEED1_MASK   (0x3 << GPIO_OSPEEDR_OSPEED1_SHIFT)
#define GPIO_OSPEEDR_OSPEED1(n)     ((n) << GPIO_OSPEEDR_OSPEED1_SHIFT)
#define GPIO_OSPEEDR_OSPEED2_SHIFT  (4)
#define GPIO_OSPEEDR_OSPEED2_MASK   (0x3 << GPIO_OSPEEDR_OSPEED2_SHIFT)
#define GPIO_OSPEEDR_OSPEED2(n)     ((n) << GPIO_OSPEEDR_OSPEED2_SHIFT)
#define GPIO_OSPEEDR_OSPEED3_SHIFT  (6)
#define GPIO_OSPEEDR_OSPEED3_MASK   (0x3 << GPIO_OSPEEDR_OSPEED3_SHIFT)
#define GPIO_OSPEEDR_OSPEED3(n)     ((n) << GPIO_OSPEEDR_OSPEED3_SHIFT)
#define GPIO_OSPEEDR_OSPEED4_SHIFT  (8)
#define GPIO_OSPEEDR_OSPEED4_MASK   (0x3 << GPIO_OSPEEDR_OSPEED4_SHIFT)
#define GPIO_OSPEEDR_OSPEED4(n)     ((n) << GPIO_OSPEEDR_OSPEED4_SHIFT)
#define GPIO_OSPEEDR_OSPEED5_SHIFT  (10)
#define GPIO_OSPEEDR_OSPEED5_MASK   (0x3 << GPIO_OSPEEDR_OSPEED5_SHIFT)
#define GPIO_OSPEEDR_OSPEED5(n)     ((n) << GPIO_OSPEEDR_OSPEED5_SHIFT)
#define GPIO_OSPEEDR_OSPEED6_SHIFT  (12)
#define GPIO_OSPEEDR_OSPEED6_MASK   (0x3 << GPIO_OSPEEDR_OSPEED6_SHIFT)
#define GPIO_OSPEEDR_OSPEED6(n)     ((n) << GPIO_OSPEEDR_OSPEED6_SHIFT)
#define GPIO_OSPEEDR_OSPEED7_SHIFT  (14)
#define GPIO_OSPEEDR_OSPEED7_MASK   (0x3 << GPIO_OSPEEDR_OSPEED7_SHIFT)
#define GPIO_OSPEEDR_OSPEED7(n)     ((n) << GPIO_OSPEEDR_OSPEED7_SHIFT)
#define GPIO_OSPEEDR_OSPEED8_SHIFT  (16)
#define GPIO_OSPEEDR_OSPEED8_MASK   (0x3 << GPIO_OSPEEDR_OSPEED8_SHIFT)
#define GPIO_OSPEEDR_OSPEED8(n)     ((n) << GPIO_OSPEEDR_OSPEED8_SHIFT)
#define GPIO_OSPEEDR_OSPEED9_SHIFT  (18)
#define GPIO_OSPEEDR_OSPEED9_MASK   (0x3 << GPIO_OSPEEDR_OSPEED9_SHIFT)
#define GPIO_OSPEEDR_OSPEED9(n)     ((n) << GPIO_OSPEEDR_OSPEED9_SHIFT)
#define GPIO_OSPEEDR_OSPEED10_SHIFT (20)
#define GPIO_OSPEEDR_OSPEED10_MASK  (0x3 << GPIO_OSPEEDR_OSPEED10_SHIFT)
#define GPIO_OSPEEDR_OSPEED10(n)    ((n) << GPIO_OSPEEDR_OSPEED10_SHIFT)
#define GPIO_OSPEEDR_OSPEED11_SHIFT (22)
#define GPIO_OSPEEDR_OSPEED11_MASK  (0x3 << GPIO_OSPEEDR_OSPEED11_SHIFT)
#define GPIO_OSPEEDR_OSPEED11(n)    ((n) << GPIO_OSPEEDR_OSPEED11_SHIFT)
#define GPIO_OSPEEDR_OSPEED12_SHIFT (24)
#define GPIO_OSPEEDR_OSPEED12_MASK  (0x3 << GPIO_OSPEEDR_OSPEED12_SHIFT)
#define GPIO_OSPEEDR_OSPEED12(n)    ((n) << GPIO_OSPEEDR_OSPEED12_SHIFT)
#define GPIO_OSPEEDR_OSPEED13_SHIFT (26)
#define GPIO_OSPEEDR_OSPEED13_MASK  (0x3 << GPIO_OSPEEDR_OSPEED13_SHIFT)
#define GPIO_OSPEEDR_OSPEED13(n)    ((n) << GPIO_OSPEEDR_OSPEED13_SHIFT)
#define GPIO_OSPEEDR_OSPEED14_SHIFT (28)
#define GPIO_OSPEEDR_OSPEED14_MASK  (0x3 << GPIO_OSPEEDR_OSPEED14_SHIFT)
#define GPIO_OSPEEDR_OSPEED14(n)    ((n) << GPIO_OSPEEDR_OSPEED14_SHIFT)
#define GPIO_OSPEEDR_OSPEED15_SHIFT (30)
#define GPIO_OSPEEDR_OSPEED15_MASK  (0x3 << GPIO_OSPEEDR_OSPEED15_SHIFT)
#define GPIO_OSPEEDR_OSPEED15(n)    ((n) << GPIO_OSPEEDR_OSPEED15_SHIFT)

/* GPIO port pull-up/pull-down register */

#define GPIO_PUPDR_PUPD0_SHIFT      (0)
#define GPIO_PUPDR_PUPD0_MASK       (0x3 << GPIO_PUPDR_PUPD0_SHIFT)
#define GPIO_PUPDR_PUPD0(n)         ((n) << GPIO_PUPDR_PUPD0_SHIFT)
#define GPIO_PUPDR_PUPD1_SHIFT      (2)
#define GPIO_PUPDR_PUPD1_MASK       (0x3 << GPIO_PUPDR_PUPD1_SHIFT)
#define GPIO_PUPDR_PUPD1(n)         ((n) << GPIO_PUPDR_PUPD1_SHIFT)
#define GPIO_PUPDR_PUPD2_SHIFT      (4)
#define GPIO_PUPDR_PUPD2_MASK       (0x3 << GPIO_PUPDR_PUPD2_SHIFT)
#define GPIO_PUPDR_PUPD2(n)         ((n) << GPIO_PUPDR_PUPD2_SHIFT)
#define GPIO_PUPDR_PUPD3_SHIFT      (6)
#define GPIO_PUPDR_PUPD3_MASK       (0x3 << GPIO_PUPDR_PUPD3_SHIFT)
#define GPIO_PUPDR_PUPD3(n)         ((n) << GPIO_PUPDR_PUPD3_SHIFT)
#define GPIO_PUPDR_PUPD4_SHIFT      (8)
#define GPIO_PUPDR_PUPD4_MASK       (0x3 << GPIO_PUPDR_PUPD4_SHIFT)
#define GPIO_PUPDR_PUPD4(n)         ((n) << GPIO_PUPDR_PUPD4_SHIFT)
#define GPIO_PUPDR_PUPD5_SHIFT      (10)
#define GPIO_PUPDR_PUPD5_MASK       (0x3 << GPIO_PUPDR_PUPD5_SHIFT)
#define GPIO_PUPDR_PUPD5(n)         ((n) << GPIO_PUPDR_PUPD5_SHIFT)
#define GPIO_PUPDR_PUPD6_SHIFT      (12)
#define GPIO_PUPDR_PUPD6_MASK       (0x3 << GPIO_PUPDR_PUPD6_SHIFT)
#define GPIO_PUPDR_PUPD6(n)         ((n) << GPIO_PUPDR_PUPD6_SHIFT)
#define GPIO_PUPDR_PUPD7_SHIFT      (14)
#define GPIO_PUPDR_PUPD7_MASK       (0x3 << GPIO_PUPDR_PUPD7_SHIFT)
#define GPIO_PUPDR_PUPD7(n)         ((n) << GPIO_PUPDR_PUPD7_SHIFT)
#define GPIO_PUPDR_PUPD8_SHIFT      (16)
#define GPIO_PUPDR_PUPD8_MASK       (0x3 << GPIO_PUPDR_PUPD8_SHIFT)
#define GPIO_PUPDR_PUPD8(n)         ((n) << GPIO_PUPDR_PUPD8_SHIFT)
#define GPIO_PUPDR_PUPD9_SHIFT      (18)
#define GPIO_PUPDR_PUPD9_MASK       (0x3 << GPIO_PUPDR_PUPD9_SHIFT)
#define GPIO_PUPDR_PUPD9(n)         ((n) << GPIO_PUPDR_PUPD9_SHIFT)
#define GPIO_PUPDR_PUPD10_SHIFT     (20)
#define GPIO_PUPDR_PUPD10_MASK      (0x3 << GPIO_PUPDR_PUPD10_SHIFT)
#define GPIO_PUPDR_PUPD10(n)        ((n) << GPIO_PUPDR_PUPD10_SHIFT)
#define GPIO_PUPDR_PUPD11_SHIFT     (22)
#define GPIO_PUPDR_PUPD11_MASK      (0x3 << GPIO_PUPDR_PUPD11_SHIFT)
#define GPIO_PUPDR_PUPD11(n)        ((n) << GPIO_PUPDR_PUPD11_SHIFT)
#define GPIO_PUPDR_PUPD12_SHIFT     (24)
#define GPIO_PUPDR_PUPD12_MASK      (0x3 << GPIO_PUPDR_PUPD12_SHIFT)
#define GPIO_PUPDR_PUPD12(n)        ((n) << GPIO_PUPDR_PUPD12_SHIFT)
#define GPIO_PUPDR_PUPD13_SHIFT     (26)
#define GPIO_PUPDR_PUPD13_MASK      (0x3 << GPIO_PUPDR_PUPD13_SHIFT)
#define GPIO_PUPDR_PUPD13(n)        ((n) << GPIO_PUPDR_PUPD13_SHIFT)
#define GPIO_PUPDR_PUPD14_SHIFT     (28)
#define GPIO_PUPDR_PUPD14_MASK      (0x3 << GPIO_PUPDR_PUPD14_SHIFT)
#define GPIO_PUPDR_PUPD14(n)        ((n) << GPIO_PUPDR_PUPD14_SHIFT)
#define GPIO_PUPDR_PUPD15_SHIFT     (30)
#define GPIO_PUPDR_PUPD15_MASK      (0x3 << GPIO_PUPDR_PUPD15_SHIFT)
#define GPIO_PUPDR_PUPD15(n)        ((n) << GPIO_PUPDR_PUPD15_SHIFT)

/* GPIO port input data register */

#define GPIO_IDR_ID0                (1 << 0)
#define GPIO_IDR_ID1                (1 << 1)
#define GPIO_IDR_ID2                (1 << 2)
#define GPIO_IDR_ID3                (1 << 3)
#define GPIO_IDR_ID4                (1 << 4)
#define GPIO_IDR_ID5                (1 << 5)
#define GPIO_IDR_ID6                (1 << 6)
#define GPIO_IDR_ID7                (1 << 7)
#define GPIO_IDR_ID8                (1 << 8)
#define GPIO_IDR_ID9                (1 << 9)
#define GPIO_IDR_ID10               (1 << 10)
#define GPIO_IDR_ID11               (1 << 11)
#define GPIO_IDR_ID12               (1 << 12)
#define GPIO_IDR_ID13               (1 << 13)
#define GPIO_IDR_ID14               (1 << 14)
#define GPIO_IDR_ID15               (1 << 15)

/* GPIO port output data register */

