apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_gpio_m33_u3u5.h
#define GPIO_ODR_OD0                (1 << 0)
#define GPIO_ODR_OD1                (1 << 1)
#define GPIO_ODR_OD2                (1 << 2)
#define GPIO_ODR_OD3                (1 << 3)
#define GPIO_ODR_OD4                (1 << 4)
#define GPIO_ODR_OD5                (1 << 5)
#define GPIO_ODR_OD6                (1 << 6)
#define GPIO_ODR_OD7                (1 << 7)
#define GPIO_ODR_OD8                (1 << 8)
#define GPIO_ODR_OD9                (1 << 9)
#define GPIO_ODR_OD10               (1 << 10)
#define GPIO_ODR_OD11               (1 << 11)
#define GPIO_ODR_OD12               (1 << 12)
#define GPIO_ODR_OD13               (1 << 13)
#define GPIO_ODR_OD14               (1 << 14)
#define GPIO_ODR_OD15               (1 << 15)

/* GPIO port bit set/reset register */

#define GPIO_BSRR_BS0               (1 << 0)
#define GPIO_BSRR_BS1               (1 << 1)
#define GPIO_BSRR_BS2               (1 << 2)
#define GPIO_BSRR_BS3               (1 << 3)
#define GPIO_BSRR_BS4               (1 << 4)
#define GPIO_BSRR_BS5               (1 << 5)
#define GPIO_BSRR_BS6               (1 << 6)
#define GPIO_BSRR_BS7               (1 << 7)
#define GPIO_BSRR_BS8               (1 << 8)
#define GPIO_BSRR_BS9               (1 << 9)
#define GPIO_BSRR_BS10              (1 << 10)
#define GPIO_BSRR_BS11              (1 << 11)
#define GPIO_BSRR_BS12              (1 << 12)
#define GPIO_BSRR_BS13              (1 << 13)
#define GPIO_BSRR_BS14              (1 << 14)
#define GPIO_BSRR_BS15              (1 << 15)
#define GPIO_BSRR_BR0               (1 << 16)
#define GPIO_BSRR_BR1               (1 << 17)
#define GPIO_BSRR_BR2               (1 << 18)
#define GPIO_BSRR_BR3               (1 << 19)
#define GPIO_BSRR_BR4               (1 << 20)
#define GPIO_BSRR_BR5               (1 << 21)
#define GPIO_BSRR_BR6               (1 << 22)
#define GPIO_BSRR_BR7               (1 << 23)
#define GPIO_BSRR_BR8               (1 << 24)
#define GPIO_BSRR_BR9               (1 << 25)
#define GPIO_BSRR_BR10              (1 << 26)
#define GPIO_BSRR_BR11              (1 << 27)
#define GPIO_BSRR_BR12              (1 << 28)
#define GPIO_BSRR_BR13              (1 << 29)
#define GPIO_BSRR_BR14              (1 << 30)
#define GPIO_BSRR_BR15              (1 << 31)

/* GPIO port configuration lock register */

#define GPIO_LCKR_LCK0              (1 << 0)
#define GPIO_LCKR_LCK1              (1 << 1)
#define GPIO_LCKR_LCK2              (1 << 2)
#define GPIO_LCKR_LCK3              (1 << 3)
#define GPIO_LCKR_LCK4              (1 << 4)
#define GPIO_LCKR_LCK5              (1 << 5)
#define GPIO_LCKR_LCK6              (1 << 6)
#define GPIO_LCKR_LCK7              (1 << 7)
#define GPIO_LCKR_LCK8              (1 << 8)
#define GPIO_LCKR_LCK9              (1 << 9)
#define GPIO_LCKR_LCK10             (1 << 10)
#define GPIO_LCKR_LCK11             (1 << 11)
#define GPIO_LCKR_LCK12             (1 << 12)
#define GPIO_LCKR_LCK13             (1 << 13)
#define GPIO_LCKR_LCK14             (1 << 14)
#define GPIO_LCKR_LCK15             (1 << 15)
#define GPIO_LCKR_LCKK              (1 << 16)

/* GPIO alternate function low register */

#define GPIO_AFRL_AFSEL0_SHIFT      (0)
#define GPIO_AFRL_AFSEL0_MASK       (0xf << GPIO_AFRL_AFSEL0_SHIFT)
#define GPIO_AFRL_AFSEL0(n)         ((n) << GPIO_AFRL_AFSEL0_SHIFT)
#define GPIO_AFRL_AFSEL1_SHIFT      (4)
#define GPIO_AFRL_AFSEL1_MASK       (0xf << GPIO_AFRL_AFSEL1_SHIFT)
#define GPIO_AFRL_AFSEL1(n)         ((n) << GPIO_AFRL_AFSEL1_SHIFT)
#define GPIO_AFRL_AFSEL2_SHIFT      (8)
#define GPIO_AFRL_AFSEL2_MASK       (0xf << GPIO_AFRL_AFSEL2_SHIFT)
#define GPIO_AFRL_AFSEL2(n)         ((n) << GPIO_AFRL_AFSEL2_SHIFT)
#define GPIO_AFRL_AFSEL3_SHIFT      (12)
#define GPIO_AFRL_AFSEL3_MASK       (0xf << GPIO_AFRL_AFSEL3_SHIFT)
#define GPIO_AFRL_AFSEL3(n)         ((n) << GPIO_AFRL_AFSEL3_SHIFT)
#define GPIO_AFRL_AFSEL4_SHIFT      (16)
#define GPIO_AFRL_AFSEL4_MASK       (0xf << GPIO_AFRL_AFSEL4_SHIFT)
#define GPIO_AFRL_AFSEL4(n)         ((n) << GPIO_AFRL_AFSEL4_SHIFT)
#define GPIO_AFRL_AFSEL5_SHIFT      (20)
#define GPIO_AFRL_AFSEL5_MASK       (0xf << GPIO_AFRL_AFSEL5_SHIFT)
#define GPIO_AFRL_AFSEL5(n)         ((n) << GPIO_AFRL_AFSEL5_SHIFT)
#define GPIO_AFRL_AFSEL6_SHIFT      (24)
#define GPIO_AFRL_AFSEL6_MASK       (0xf << GPIO_AFRL_AFSEL6_SHIFT)
#define GPIO_AFRL_AFSEL6(n)         ((n) << GPIO_AFRL_AFSEL6_SHIFT)
#define GPIO_AFRL_AFSEL7_SHIFT      (28)
#define GPIO_AFRL_AFSEL7_MASK       (0xf << GPIO_AFRL_AFSEL7_SHIFT)
#define GPIO_AFRL_AFSEL7(n)         ((n) << GPIO_AFRL_AFSEL7_SHIFT)

/* GPIO alternate function high register */

#define GPIO_AFRH_AFSEL8_SHIFT      (0)
#define GPIO_AFRH_AFSEL8_MASK       (0xf << GPIO_AFRH_AFSEL8_SHIFT)
#define GPIO_AFRH_AFSEL8(n)         ((n) << GPIO_AFRH_AFSEL8_SHIFT)
#define GPIO_AFRH_AFSEL9_SHIFT      (4)
#define GPIO_AFRH_AFSEL9_MASK       (0xf << GPIO_AFRH_AFSEL9_SHIFT)
#define GPIO_AFRH_AFSEL9(n)         ((n) << GPIO_AFRH_AFSEL9_SHIFT)
#define GPIO_AFRH_AFSEL10_SHIFT     (8)
#define GPIO_AFRH_AFSEL10_MASK      (0xf << GPIO_AFRH_AFSEL10_SHIFT)
#define GPIO_AFRH_AFSEL10(n)        ((n) << GPIO_AFRH_AFSEL10_SHIFT)
#define GPIO_AFRH_AFSEL11_SHIFT     (12)
#define GPIO_AFRH_AFSEL11_MASK      (0xf << GPIO_AFRH_AFSEL11_SHIFT)
#define GPIO_AFRH_AFSEL11(n)        ((n) << GPIO_AFRH_AFSEL11_SHIFT)
#define GPIO_AFRH_AFSEL12_SHIFT     (16)
#define GPIO_AFRH_AFSEL12_MASK      (0xf << GPIO_AFRH_AFSEL12_SHIFT)
#define GPIO_AFRH_AFSEL12(n)        ((n) << GPIO_AFRH_AFSEL12_SHIFT)
#define GPIO_AFRH_AFSEL13_SHIFT     (20)
#define GPIO_AFRH_AFSEL13_MASK      (0xf << GPIO_AFRH_AFSEL13_SHIFT)
#define GPIO_AFRH_AFSEL13(n)        ((n) << GPIO_AFRH_AFSEL13_SHIFT)
#define GPIO_AFRH_AFSEL14_SHIFT     (24)
#define GPIO_AFRH_AFSEL14_MASK      (0xf << GPIO_AFRH_AFSEL14_SHIFT)
#define GPIO_AFRH_AFSEL14(n)        ((n) << GPIO_AFRH_AFSEL14_SHIFT)
#define GPIO_AFRH_AFSEL15_SHIFT     (28)
#define GPIO_AFRH_AFSEL15_MASK      (0xf << GPIO_AFRH_AFSEL15_SHIFT)
#define GPIO_AFRH_AFSEL15(n)        ((n) << GPIO_AFRH_AFSEL15_SHIFT)

/* GPIO port bit reset register */

