apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_gpio_m33_u3u5.h
#define GPIO_BRR_BR0                (1 << 0)
#define GPIO_BRR_BR1                (1 << 1)
#define GPIO_BRR_BR2                (1 << 2)
#define GPIO_BRR_BR3                (1 << 3)
#define GPIO_BRR_BR4                (1 << 4)
#define GPIO_BRR_BR5                (1 << 5)
#define GPIO_BRR_BR6                (1 << 6)
#define GPIO_BRR_BR7                (1 << 7)
#define GPIO_BRR_BR8                (1 << 8)
#define GPIO_BRR_BR9                (1 << 9)
#define GPIO_BRR_BR10               (1 << 10)
#define GPIO_BRR_BR11               (1 << 11)
#define GPIO_BRR_BR12               (1 << 12)
#define GPIO_BRR_BR13               (1 << 13)
#define GPIO_BRR_BR14               (1 << 14)
#define GPIO_BRR_BR15               (1 << 15)

/* GPIO high-speed low-voltage register */

#define GPIO_HSLVR_HSLV0            (1 << 0)
#define GPIO_HSLVR_HSLV1            (1 << 1)
#define GPIO_HSLVR_HSLV2            (1 << 2)
#define GPIO_HSLVR_HSLV3            (1 << 3)
#define GPIO_HSLVR_HSLV4            (1 << 4)
#define GPIO_HSLVR_HSLV5            (1 << 5)
#define GPIO_HSLVR_HSLV6            (1 << 6)
#define GPIO_HSLVR_HSLV7            (1 << 7)
#define GPIO_HSLVR_HSLV8            (1 << 8)
#define GPIO_HSLVR_HSLV9            (1 << 9)
#define GPIO_HSLVR_HSLV10           (1 << 10)
#define GPIO_HSLVR_HSLV11           (1 << 11)
#define GPIO_HSLVR_HSLV12           (1 << 12)
#define GPIO_HSLVR_HSLV13           (1 << 13)
#define GPIO_HSLVR_HSLV14           (1 << 14)
#define GPIO_HSLVR_HSLV15           (1 << 15)

/* GPIO secure configuration register */

#define GPIO_SECCFGR_SEC0           (1 << 0)
#define GPIO_SECCFGR_SEC1           (1 << 1)
#define GPIO_SECCFGR_SEC2           (1 << 2)
#define GPIO_SECCFGR_SEC3           (1 << 3)
#define GPIO_SECCFGR_SEC4           (1 << 4)
#define GPIO_SECCFGR_SEC5           (1 << 5)
#define GPIO_SECCFGR_SEC6           (1 << 6)
#define GPIO_SECCFGR_SEC7           (1 << 7)
#define GPIO_SECCFGR_SEC8           (1 << 8)
#define GPIO_SECCFGR_SEC9           (1 << 9)
#define GPIO_SECCFGR_SEC10          (1 << 10)
#define GPIO_SECCFGR_SEC11          (1 << 11)
#define GPIO_SECCFGR_SEC12          (1 << 12)
#define GPIO_SECCFGR_SEC13          (1 << 13)
#define GPIO_SECCFGR_SEC14          (1 << 14)
#define GPIO_SECCFGR_SEC15          (1 << 15)

/* NuttX GPIO Configuration Definitions *************************************/

/* GPIO port mode register */

#define GPIO_MODER_INPUT              (0)
#define GPIO_MODER_OUTPUT             (1)
#define GPIO_MODER_ALT                (2)
#define GPIO_MODER_ANALOG             (3)
#define GPIO_MODER_SHIFT(n)           ((n) << 1)
#define GPIO_MODER_MASK(n)            (3 << GPIO_MODER_SHIFT(n))
#define GPIO_MODER0_SHIFT              GPIO_MODER_MODE0_SHIFT
#define GPIO_MODER0_MASK               GPIO_MODER_MODE0_MASK
#define GPIO_MODER1_SHIFT              GPIO_MODER_MODE1_SHIFT
#define GPIO_MODER1_MASK               GPIO_MODER_MODE1_MASK
#define GPIO_MODER2_SHIFT              GPIO_MODER_MODE2_SHIFT
#define GPIO_MODER2_MASK               GPIO_MODER_MODE2_MASK
#define GPIO_MODER3_SHIFT              GPIO_MODER_MODE3_SHIFT
#define GPIO_MODER3_MASK               GPIO_MODER_MODE3_MASK
#define GPIO_MODER4_SHIFT              GPIO_MODER_MODE4_SHIFT
#define GPIO_MODER4_MASK               GPIO_MODER_MODE4_MASK
#define GPIO_MODER5_SHIFT              GPIO_MODER_MODE5_SHIFT
#define GPIO_MODER5_MASK               GPIO_MODER_MODE5_MASK
#define GPIO_MODER6_SHIFT              GPIO_MODER_MODE6_SHIFT
#define GPIO_MODER6_MASK               GPIO_MODER_MODE6_MASK
#define GPIO_MODER7_SHIFT              GPIO_MODER_MODE7_SHIFT
#define GPIO_MODER7_MASK               GPIO_MODER_MODE7_MASK
#define GPIO_MODER8_SHIFT              GPIO_MODER_MODE8_SHIFT
#define GPIO_MODER8_MASK               GPIO_MODER_MODE8_MASK
#define GPIO_MODER9_SHIFT              GPIO_MODER_MODE9_SHIFT
#define GPIO_MODER9_MASK               GPIO_MODER_MODE9_MASK
#define GPIO_MODER10_SHIFT             GPIO_MODER_MODE10_SHIFT
#define GPIO_MODER10_MASK              GPIO_MODER_MODE10_MASK
#define GPIO_MODER11_SHIFT             GPIO_MODER_MODE11_SHIFT
#define GPIO_MODER11_MASK              GPIO_MODER_MODE11_MASK
#define GPIO_MODER12_SHIFT             GPIO_MODER_MODE12_SHIFT
#define GPIO_MODER12_MASK              GPIO_MODER_MODE12_MASK
#define GPIO_MODER13_SHIFT             GPIO_MODER_MODE13_SHIFT
#define GPIO_MODER13_MASK              GPIO_MODER_MODE13_MASK
#define GPIO_MODER14_SHIFT             GPIO_MODER_MODE14_SHIFT
#define GPIO_MODER14_MASK              GPIO_MODER_MODE14_MASK
#define GPIO_MODER15_SHIFT             GPIO_MODER_MODE15_SHIFT
#define GPIO_MODER15_MASK              GPIO_MODER_MODE15_MASK

/* GPIO port output type register */

#define GPIO_OTYPER_OD(n)             (1 << (n))
#define GPIO_OTYPER_PP(n)             (0)

/* GPIO port output speed register */

#define GPIO_OSPEED_2MHZ              (0)
#define GPIO_OSPEED_25MHZ             (1)
#define GPIO_OSPEED_50MHZ             (2)
#define GPIO_OSPEED_100MHZ            (3)
#define GPIO_OSPEED_SHIFT(n)          ((n) << 1)
#define GPIO_OSPEED_MASK(n)           (3 << GPIO_OSPEED_SHIFT(n))
#define GPIO_OSPEED0_SHIFT             GPIO_OSPEEDR_OSPEED0_SHIFT
#define GPIO_OSPEED0_MASK              GPIO_OSPEEDR_OSPEED0_MASK
#define GPIO_OSPEED1_SHIFT             GPIO_OSPEEDR_OSPEED1_SHIFT
#define GPIO_OSPEED1_MASK              GPIO_OSPEEDR_OSPEED1_MASK
#define GPIO_OSPEED2_SHIFT             GPIO_OSPEEDR_OSPEED2_SHIFT
#define GPIO_OSPEED2_MASK              GPIO_OSPEEDR_OSPEED2_MASK
#define GPIO_OSPEED3_SHIFT             GPIO_OSPEEDR_OSPEED3_SHIFT
#define GPIO_OSPEED3_MASK              GPIO_OSPEEDR_OSPEED3_MASK
#define GPIO_OSPEED4_SHIFT             GPIO_OSPEEDR_OSPEED4_SHIFT
#define GPIO_OSPEED4_MASK              GPIO_OSPEEDR_OSPEED4_MASK
#define GPIO_OSPEED5_SHIFT             GPIO_OSPEEDR_OSPEED5_SHIFT
#define GPIO_OSPEED5_MASK              GPIO_OSPEEDR_OSPEED5_MASK
#define GPIO_OSPEED6_SHIFT             GPIO_OSPEEDR_OSPEED6_SHIFT
#define GPIO_OSPEED6_MASK              GPIO_OSPEEDR_OSPEED6_MASK
#define GPIO_OSPEED7_SHIFT             GPIO_OSPEEDR_OSPEED7_SHIFT
#define GPIO_OSPEED7_MASK              GPIO_OSPEEDR_OSPEED7_MASK
#define GPIO_OSPEED8_SHIFT             GPIO_OSPEEDR_OSPEED8_SHIFT
#define GPIO_OSPEED8_MASK              GPIO_OSPEEDR_OSPEED8_MASK
#define GPIO_OSPEED9_SHIFT             GPIO_OSPEEDR_OSPEED9_SHIFT
#define GPIO_OSPEED9_MASK              GPIO_OSPEEDR_OSPEED9_MASK
#define GPIO_OSPEED10_SHIFT            GPIO_OSPEEDR_OSPEED10_SHIFT
#define GPIO_OSPEED10_MASK             GPIO_OSPEEDR_OSPEED10_MASK
#define GPIO_OSPEED11_SHIFT            GPIO_OSPEEDR_OSPEED11_SHIFT
#define GPIO_OSPEED11_MASK             GPIO_OSPEEDR_OSPEED11_MASK
#define GPIO_OSPEED12_SHIFT            GPIO_OSPEEDR_OSPEED12_SHIFT
#define GPIO_OSPEED12_MASK             GPIO_OSPEEDR_OSPEED12_MASK
#define GPIO_OSPEED13_SHIFT            GPIO_OSPEEDR_OSPEED13_SHIFT
#define GPIO_OSPEED13_MASK             GPIO_OSPEEDR_OSPEED13_MASK
#define GPIO_OSPEED14_SHIFT            GPIO_OSPEEDR_OSPEED14_SHIFT
#define GPIO_OSPEED14_MASK             GPIO_OSPEEDR_OSPEED14_MASK
#define GPIO_OSPEED15_SHIFT            GPIO_OSPEEDR_OSPEED15_SHIFT
#define GPIO_OSPEED15_MASK             GPIO_OSPEEDR_OSPEED15_MASK

/* GPIO port pull-up/pull-down register */

#define GPIO_PUPDR_NONE               (0)
#define GPIO_PUPDR_PULLUP             (1)
#define GPIO_PUPDR_PULLDOWN           (2)
#define GPIO_PUPDR_SHIFT(n)           ((n) << 1)
#define GPIO_PUPDR_MASK(n)            (3 << GPIO_PUPDR_SHIFT(n))
#define GPIO_PUPDR0_SHIFT              GPIO_PUPDR_PUPD0_SHIFT
#define GPIO_PUPDR0_MASK               GPIO_PUPDR_PUPD0_MASK
#define GPIO_PUPDR1_SHIFT              GPIO_PUPDR_PUPD1_SHIFT
#define GPIO_PUPDR1_MASK               GPIO_PUPDR_PUPD1_MASK
#define GPIO_PUPDR2_SHIFT              GPIO_PUPDR_PUPD2_SHIFT
#define GPIO_PUPDR2_MASK               GPIO_PUPDR_PUPD2_MASK
#define GPIO_PUPDR3_SHIFT              GPIO_PUPDR_PUPD3_SHIFT
#define GPIO_PUPDR3_MASK               GPIO_PUPDR_PUPD3_MASK
#define GPIO_PUPDR4_SHIFT              GPIO_PUPDR_PUPD4_SHIFT
#define GPIO_PUPDR4_MASK               GPIO_PUPDR_PUPD4_MASK
#define GPIO_PUPDR5_SHIFT              GPIO_PUPDR_PUPD5_SHIFT
#define GPIO_PUPDR5_MASK               GPIO_PUPDR_PUPD5_MASK
#define GPIO_PUPDR6_SHIFT              GPIO_PUPDR_PUPD6_SHIFT
#define GPIO_PUPDR6_MASK               GPIO_PUPDR_PUPD6_MASK
#define GPIO_PUPDR7_SHIFT              GPIO_PUPDR_PUPD7_SHIFT
#define GPIO_PUPDR7_MASK               GPIO_PUPDR_PUPD7_MASK
#define GPIO_PUPDR8_SHIFT              GPIO_PUPDR_PUPD8_SHIFT
#define GPIO_PUPDR8_MASK               GPIO_PUPDR_PUPD8_MASK
#define GPIO_PUPDR9_SHIFT              GPIO_PUPDR_PUPD9_SHIFT
#define GPIO_PUPDR9_MASK               GPIO_PUPDR_PUPD9_MASK
#define GPIO_PUPDR10_SHIFT             GPIO_PUPDR_PUPD10_SHIFT
#define GPIO_PUPDR10_MASK              GPIO_PUPDR_PUPD10_MASK
#define GPIO_PUPDR11_SHIFT             GPIO_PUPDR_PUPD11_SHIFT
#define GPIO_PUPDR11_MASK              GPIO_PUPDR_PUPD11_MASK
#define GPIO_PUPDR12_SHIFT             GPIO_PUPDR_PUPD12_SHIFT
#define GPIO_PUPDR12_MASK              GPIO_PUPDR_PUPD12_MASK
#define GPIO_PUPDR13_SHIFT             GPIO_PUPDR_PUPD13_SHIFT
#define GPIO_PUPDR13_MASK              GPIO_PUPDR_PUPD13_MASK
#define GPIO_PUPDR14_SHIFT             GPIO_PUPDR_PUPD14_SHIFT
#define GPIO_PUPDR14_MASK              GPIO_PUPDR_PUPD14_MASK
#define GPIO_PUPDR15_SHIFT             GPIO_PUPDR_PUPD15_SHIFT
#define GPIO_PUPDR15_MASK              GPIO_PUPDR_PUPD15_MASK

/* GPIO port input and output data registers */

#define GPIO_IDR(n)                   (1 << (n))
#define GPIO_ODR(n)                   (1 << (n))

