apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_gpio_m33_u3u5.h
/* GPIO port bit set/reset register */

#define GPIO_BSRR_SET(n)              (1 << (n))
#define GPIO_BSRR_RESET(n)            (1 << ((n) + 16))

/* GPIO port configuration lock register */

#define GPIO_LCKR(n)                  (1 << (n))
#define GPIO_LCKK                     GPIO_LCKR_LCKK

/* GPIO alternate function low/high registers */

#define GPIO_AFR_SHIFT(n)             ((n) << 2)
#define GPIO_AFR_MASK(n)              (15 << GPIO_AFR_SHIFT(n))
#define GPIO_AFRL0_SHIFT               GPIO_AFRL_AFSEL0_SHIFT
#define GPIO_AFRL0_MASK                GPIO_AFRL_AFSEL0_MASK
#define GPIO_AFRL1_SHIFT               GPIO_AFRL_AFSEL1_SHIFT
#define GPIO_AFRL1_MASK                GPIO_AFRL_AFSEL1_MASK
#define GPIO_AFRL2_SHIFT               GPIO_AFRL_AFSEL2_SHIFT
#define GPIO_AFRL2_MASK                GPIO_AFRL_AFSEL2_MASK
#define GPIO_AFRL3_SHIFT               GPIO_AFRL_AFSEL3_SHIFT
#define GPIO_AFRL3_MASK                GPIO_AFRL_AFSEL3_MASK
#define GPIO_AFRL4_SHIFT               GPIO_AFRL_AFSEL4_SHIFT
#define GPIO_AFRL4_MASK                GPIO_AFRL_AFSEL4_MASK
#define GPIO_AFRL5_SHIFT               GPIO_AFRL_AFSEL5_SHIFT
#define GPIO_AFRL5_MASK                GPIO_AFRL_AFSEL5_MASK
#define GPIO_AFRL6_SHIFT               GPIO_AFRL_AFSEL6_SHIFT
#define GPIO_AFRL6_MASK                GPIO_AFRL_AFSEL6_MASK
#define GPIO_AFRL7_SHIFT               GPIO_AFRL_AFSEL7_SHIFT
#define GPIO_AFRL7_MASK                GPIO_AFRL_AFSEL7_MASK
#define GPIO_AFRH8_SHIFT               GPIO_AFRH_AFSEL8_SHIFT
#define GPIO_AFRH8_MASK                GPIO_AFRH_AFSEL8_MASK
#define GPIO_AFRH9_SHIFT               GPIO_AFRH_AFSEL9_SHIFT
#define GPIO_AFRH9_MASK                GPIO_AFRH_AFSEL9_MASK
#define GPIO_AFRH10_SHIFT              GPIO_AFRH_AFSEL10_SHIFT
#define GPIO_AFRH10_MASK               GPIO_AFRH_AFSEL10_MASK
#define GPIO_AFRH11_SHIFT              GPIO_AFRH_AFSEL11_SHIFT
#define GPIO_AFRH11_MASK               GPIO_AFRH_AFSEL11_MASK
#define GPIO_AFRH12_SHIFT              GPIO_AFRH_AFSEL12_SHIFT
#define GPIO_AFRH12_MASK               GPIO_AFRH_AFSEL12_MASK
#define GPIO_AFRH13_SHIFT              GPIO_AFRH_AFSEL13_SHIFT
#define GPIO_AFRH13_MASK               GPIO_AFRH_AFSEL13_MASK
#define GPIO_AFRH14_SHIFT              GPIO_AFRH_AFSEL14_SHIFT
#define GPIO_AFRH14_MASK               GPIO_AFRH_AFSEL14_MASK
#define GPIO_AFRH15_SHIFT              GPIO_AFRH_AFSEL15_SHIFT
#define GPIO_AFRH15_MASK               GPIO_AFRH_AFSEL15_MASK

/* GPIO port bit reset register */

#define GPIO_BRR_SET(n)               (1 << (n))

/* GPIO high-speed low-voltage register */

#define GPIO_HSLVR_SET(n)             (1 << (n))

/* GPIO port secure configuration register */

#define GPIO_SECCFGR_SET(n)           (1 << (n))

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_GPIO_M33_U3U5_H */
